package chapter3;

// Вычислить площадь круга
public class Area {
    public static void main(String[] args) {
        double pi, r, а;
        r = 10.8; // радиус окружности
        pi = 3.1416; // приблизительное значение числа пи
        а = pi * r * r; // вычислить площадь круга
        System.out.println("Плoщaдь круга равна " + а);


    }
}
